---------- ΑΛΓΟΡΙΘΜΟΣ main() ----------------
	
	/* 1. Αν δεν υπάρχει ακριβώς 1 παράμετρος,
	 * μήνυμα λάθους και έξοδος */
	
	/* 2. Αν η παράμετρος είναι < 3,
	 * μήνυμα λάθους και έξοδος */

	// 3. Δημιουργία του board
	
	// 4. Επιλογή συμβόλων παικτών
	
	// 5. Επόμενος παίκτης ο Παίκτης 1
	
	// 6. επανάληψη ....
	
		// 6.1. Παίζει ο επόμενος Παίκτης

		// 6.2. Εμφάνιση Τρίλιζας

		// 6.3. Αλλαγή παίκτη
		
	// ... μέχρι να τελειώσει το παιχνίδι

	// 7. Εκτύπωση αποτελέσματος

-----------------------------------------------

---------- ΣΗΜΑΝΤΙΚΑ ΣΗΜΕΙΑ -------------------

Στη C δεν υπάρχει boolean type και χρησιμοποιείται το int για τον
σκοπό αυτό. H τιμή 0 --> false και η τιμή <>0 --> true.

3. Δημιουργία του board
	α) θα δέχεται ως είσοδο το N και θα επιστρέφει true(1) ή 
		false(0)
	β) μετά την κάθε απόπειρα malloc() πρέπει να ελέγχεται αν ο
	   δείκτης (== NULL) και αν συμβαίνει αυτό να γίνονται free()
	   όσες περιοχές μνήμης είχαν δεσμευτεί επιτυχώς.
	γ) Θα πρέπει να αρχικοποιηθούν κάποιες μεταβλητές όπως η
	   board->size και κάποιες χρήσιμες όπως int freeCells που
	   θα κρατά το πλήθος των κενών κελιών
	δ) ο έλεγχος της σωστής λειτουργίας θα απαιτήσει να κάνεις
	   μερικές απευθείας αναθέσεις σε στοιχεία (2 ή 3) και την
	   εκτύπωση του πίνακα με μια απαραίτητη displayBoard().

	// το B είναι ο δείκτης στο _board και Ν η παράμετρος
	// που μας έδωσαν στο argv[1]
	
	// εκκίνηση δημιουργίας Τρίλιζας
	// αποθήκευση του N στο B->size
	// δέσμευση N (int *) που θα δείχνουν στις γραμμές
	// για κάθε γραμμή
		// δέσμευση Ν (int) που θα είναι μια γραμμή
			// για κάθε στήλη της γραμμής
				// αρχικοποίηση τιμής κελιού
				// επόμενη στήλη
		// επόμενη γραμμή
	// επιστροφή με επιτυχία

